In [1]:
import pandas as pd

In [5]:
df = pd.read_csv("raw_data.csv")
df2 = df.copy()

df2 = df2.drop_duplicates()
df2 = df2.sort_values("income")
df2 = df2.reset_index(drop=True)
df2

   id          name   age country   gender   income
0   9   Carlos Ruiz   NaN  Mexico     Male  45000.0
1   3          Alex   NaN     USA  Unknown  47000.0
2   5        Li Wei  27.0   China     Male  51000.0
3   1      John Doe  29.0     USA     Male  55000.0
4  10   Emily Davis  31.0     USA      NaN  58000.0
5   2    Jane Smith   NaN  Canada   Female  62000.0
6   8    Rachel Lee  29.0     USA   Female  62000.0
7   7    Ahmed Khan  38.0     NaN     Male  68000.0
8   6           NaN  45.0   India   Female  73000.0
9   4  Maria Garcia  34.0   Spain   Female      NaN

Grouping & Aggregation of Data
1. groupby()
2. mean/sum/max/min/count etc
3. agg()

In [11]:
# each countries person avg income
df2.groupby("country")["income"].mean()

# avg income by gender
df2.groupby("gender")["income"].mean()


# all data(min, max and avg) for each country
df2.groupby("country")["income"].agg(["mean", "max", "min"])

# all data(min, max and avg) for each country, with changing collum name.
df2.groupby("country")["income"].agg(avg_salary="mean", maxi_salary="max", min_salary="min")

         avg_salary  maxi_salary  min_salary
country
Canada      62000.0      62000.0     62000.0
China       51000.0      51000.0     51000.0
India       73000.0      73000.0     73000.0
Mexico      45000.0      45000.0     45000.0
Spain           NaN          NaN         NaN
USA         55500.0      62000.0     47000.0